import { Chart, Plant } from '@/images';
import { Separator } from './ui/separator';
const mock = [
  {
    icon: Plant,
    title: 'Бид химийн нэгдэлгүй эко түүхий эдээр бүтээгдэхүүн үйлдвэрлэдэг.',
    descOne:
      'Монголын үйлдвэрлэгчид байгалаас авсан түүхий эдийг хамгийн бага боловсруулалттайгаар химийн нэмэлт нэгдэл хамгийн багаар үйлдвэрлэдэг. Энэ нь хуурай газар болон далайн орчинд хамгийн хурдан шингэдэг, орчны бохирдлыг бага байхаар бүтээдэг онцлогтой.',
    descTwo:
      'Үйлдвэрлэгчдийн бүтээсэн ноос ноолуур гэхэд 100% био задрах чадвартай байгаад зогсохгүй хөрсний эрүүл мэндийг сайжруулж, газрын хөрсөнд шим тэжээлийг буцаан өгдөг ач холбогдолтой бүтээгдэхүүн юм.',
    descThree:
      'ТХБ - 12 буюу хариуцлагатай хэрэглээг дэмжих “Тогтвортой хөгжил -2030 хөтөлбөр”-ийг анх 2012 онд Рио Де Жанейро хотод дэлхийн улс орнуудын төрийн тэргүүд оролцсон НҮБ-ын “Тогтвортой хөгжил” бага хурлын үеэр “Мянганы хөгжлийн зорилтууд”-ын үргэлжлэл болгохоор санаачилжээ. 2015 онд НҮБ-ын Ерөнхий Асамблейн 70 дугаар чуулган болж, ТХЗ-ын 17 зорилго, 169 зорилтыг баталж, 2016 оны 1 сарын 1-нээс “Тогтвортой хөгжлийн зорилго” (ТХЗ) албан ёсоор дэлхий нийтээр хэрэгжиж эхэлсэн.',
    descFour:
      'Дэлхийн ихэнх улсууд Тогтвортой Хөгжил руу чиглэж, Зорилт - 12-ын хүрээнд Хариуцлагатай хэрэглээг дэмжиж байна. Бидний зорилтот зах зээл Европын Холбоо нь ТХБ хэрэгжүүлэгчийн индексээр дэлхийд тэргүүлэгч улсуудыг багтаадаг, эко бүтээгдэхүүнийг түлхүү хэрэглэдэг.',
  },
  {
    icon: Chart,
    title: 'Дэлхийн хүн амын  худалдан авах хэрэгцээ өссөөр байна.',
    descOne:
      'Дэлхийн нийт улс орнуудын экспортын дүн 25 их наяд $ байна. Монгол улсын экспорт 2023 оны байдлаар 15.1 тэрбум $ байгаа хэдий ч үүнд уул уурхайн бус экспортын дүн 6%-ийг эзлэж байна. Дэлхийн хүн ам өсөхийн хирээр худалдан авах хэрэгцээ ихэссээр байгаа нь монголын үйлдвэрлэгчдийн бүтээсэн бараа бүтээгдэхүүн дэлхийн зах зээлд борлогдох боломж, хэрэгцээ маш их байгааг илтгэж байна.',
  },
];

export const World = () => {
  return (
    <div className='flex justify-between w-full bg-transparent text-white overflow-hidden max-xl:h-[1000px] max-md:flex-col'>
      <div className='flex items-center h-96 md:w-[547px] w-fit'>
        <h1 className='font-extralight text-6xl text-start max-lg:text-4xl'>
          Дэлхий яагаад монголын бүтээгдэхүүнийг сонгох вэ?
        </h1>
      </div>
      <div className='flex flex-col md:w-[650px] w-fit'>
        {mock.map((element, index: number) => {
          const Icon = element.icon;
          return (
            <div key={index} className='flex flex-col gap-6'>
              <Icon />
              <h1 className='font-bold text-2xl'>{element.title}</h1>
              <p>{element.descOne}</p>
              <p>{element.descTwo}</p>
              <p>{element.descThree}</p>
              <p>{element.descFour}</p>
              {index < mock.length - 1 && <Separator className='mb-7' />}
            </div>
          );
        })}
      </div>
    </div>
  );
};
